[
    {
        "id": 1,
        "name": "Margherita Pizza",
        "tags": "Italian, Pizza, Vegetarian, Dinner",
        "time": 30,
        "difficulty": "Easy",
        "ratings": 4.8,
        "isFavorite": true,
        "description": "A timeless classic, Margherita Pizza features a thin and crispy crust topped with a simple yet flavorful combination of fresh tomatoes, mozzarella cheese, and fragrant basil leaves. The tangy tomato sauce and the creamy cheese are perfectly balanced by the aromatic basil, making this pizza a favorite for all ages.",
        "author": "Chef Giovanni",
        "imageName": "margherita",
        "category": "Pizza"
    },
    {
        "id": 2,
        "name": "Pepperoni Pizza",
        "tags": "Italian, Pizza, Spicy, Dinner",
        "time": 35,
        "difficulty": "Easy",
        "ratings": 4.6,
        "isFavorite": true,
        "description": "A popular choice among pizza lovers, Pepperoni Pizza is loaded with spicy slices of pepperoni over a bed of melted mozzarella and tangy tomato sauce. The pepperoni crisps up beautifully in the oven, adding a satisfying crunch and a burst of flavor to each bite. Perfect for a casual dinner or a party with friends.",
        "author": "Chef Giovanni",
        "imageName": "pepperoni",
        "category": "Pizza"
    },
    {
        "id": 3,
        "name": "BBQ Chicken Pizza",
        "tags": "American, Pizza, Dinner",
        "time": 40,
        "difficulty": "Medium",
        "ratings": 4.7,
        "isFavorite": false,
        "description": "This BBQ Chicken Pizza is a delightful twist on the traditional pizza, featuring tender grilled chicken pieces smothered in smoky barbecue sauce, red onions, and a blend of cheeses. The sweet and tangy BBQ sauce perfectly complements the savory chicken, while the red onions add a touch of sharpness to each bite.",
        "author": "Chef Rachel",
        "imageName": "bbq_chicken",
        "category": "Pizza"
    },
    {
        "id": 4,
        "name": "Spaghetti Bolognese",
        "tags": "Italian, Pasta, Dinner",
        "time": 60,
        "difficulty": "Medium",
        "ratings": 4.7,
        "isFavorite": true,
        "description": "Spaghetti Bolognese is a hearty and comforting dish, featuring a rich and meaty tomato sauce simmered to perfection. Ground beef, onions, garlic, and herbs are slowly cooked with tomatoes and red wine to create a flavorful sauce that is served over al dente spaghetti. Topped with freshly grated Parmesan cheese, this dish is a classic favorite for a reason.",
        "author": "Chef Giovanni",
        "imageName": "bolognese",
        "category": "Pasta"
    },
    {
        "id": 5,
        "name": "Fettuccine Alfredo",
        "tags": "Italian, Pasta, Creamy, Dinner",
        "time": 25,
        "difficulty": "Easy",
        "ratings": 4.8,
        "isFavorite": true,
        "description": "Fettuccine Alfredo is a creamy and indulgent pasta dish that is incredibly easy to make. The dish features fettuccine pasta coated in a rich and velvety sauce made from butter, heavy cream, and Parmesan cheese. The result is a smooth and satisfying meal that is perfect for a quick weeknight dinner or a special occasion.",
        "author": "Chef Rachel",
        "imageName": "alfredo",
        "category": "Pasta"
    },
    {
        "id": 6,
        "name": "Penne Arrabbiata",
        "tags": "Italian, Pasta, Spicy, Dinner",
        "time": 20,
        "difficulty": "Easy",
        "ratings": 4.6,
        "isFavorite": false,
        "description": "Penne Arrabbiata is a spicy pasta dish that packs a punch. The sauce is made from tomatoes, garlic, and red chili peppers, giving it a fiery kick. Tossed with penne pasta, this dish is simple yet flavorful, perfect for those who enjoy a bit of heat in their meals. Garnish with fresh parsley and Parmesan for a complete dish.",
        "author": "Chef Luigi",
        "imageName": "arrabbiata",
        "category": "Pasta"
    },
    {
        "id": 7,
        "name": "Caesar Salad",
        "tags": "American, Salad, Healthy, Dinner",
        "time": 15,
        "difficulty": "Easy",
        "ratings": 4.8,
        "isFavorite": true,
        "description": "Caesar Salad is a crisp and refreshing dish featuring romaine lettuce, crunchy croutons, and a creamy Caesar dressing made from garlic, anchovies, Parmesan cheese, and lemon juice. Topped with freshly grated Parmesan and a sprinkle of black pepper, this salad is a perfect side dish or a light main course when topped with grilled chicken.",
        "author": "Chef Giovanni",
        "imageName": "caesar",
        "category": "Salad"
    },
    {
        "id": 8,
        "name": "Greek Salad",
        "tags": "Greek, Salad, Vegetarian, Healthy, Dinner",
        "time": 10,
        "difficulty": "Easy",
        "ratings": 4.7,
        "isFavorite": true,
        "description": "Greek Salad is a vibrant and healthy dish packed with fresh flavors. Crisp cucumbers, juicy tomatoes, red onions, and Kalamata olives are tossed with creamy feta cheese and a tangy dressing made from olive oil, lemon juice, and oregano. This salad is perfect as a side dish or a light lunch on a warm day.",
        "author": "Chef Rachel",
        "imageName": "greek",
        "category": "Salad"
    },
    {
        "id": 9,
        "name": "Cobb Salad",
        "tags": "American, Salad, Protein-rich, Dinner",
        "time": 20,
        "difficulty": "Medium",
        "ratings": 4.6,
        "isFavorite": false,
        "description": "Cobb Salad is a hearty and satisfying dish that is perfect for lunch or dinner. It features a bed of mixed greens topped with grilled chicken, crispy bacon, hard-boiled eggs, avocado, tomatoes, and blue cheese. Drizzled with a tangy vinaigrette, this salad is a complete meal that is both delicious and filling.",
        "author": "Chef Luigi",
        "imageName": "cobb",
        "category": "Salad"
    },
    {
        "id": 10,
        "name": "Classic Cheeseburger",
        "tags": "American, Burger, Dinner",
        "time": 20,
        "difficulty": "Easy",
        "ratings": 4.8,
        "isFavorite": true,
        "description": "The Classic Cheeseburger is an all-time favorite that features a juicy beef patty topped with melted cheddar cheese, crisp lettuce, ripe tomatoes, pickles, and onions, all nestled in a soft sesame seed bun. This burger is perfect for a quick and satisfying meal, with a perfect balance of flavors and textures in every bite.",
        "author": "Chef Rachel",
        "imageName": "cheeseburger",
        "category": "Burger"
    },
    {
        "id": 11,
        "name": "BBQ Bacon Burger",
        "tags": "American, Burger, BBQ, Dinner",
        "time": 25,
        "difficulty": "Medium",
        "ratings": 4.7,
        "isFavorite": true,
        "description": "The BBQ Bacon Burger is a flavorful twist on the classic burger, featuring a juicy beef patty topped with crispy bacon, melted cheddar cheese, and smoky barbecue sauce. The burger is served on a toasted bun with a crunchy onion ring and a dollop of tangy BBQ sauce, making it a mouthwatering meal for any BBQ lover.",
        "author": "Chef Luigi",
        "imageName": "bbq_bacon",
        "category": "Burger"
    },
    {
        "id": 12,
        "name": "Veggie Burger",
        "tags": "Vegetarian, Burger, Healthy, Dinner",
        "time": 30,
        "difficulty": "Medium",
        "ratings": 4.6,
        "isFavorite": false,
        "description": "The Veggie Burger is a delicious and healthy alternative to traditional beef burgers. Made from a blend of black beans, quinoa, and spices, the patty is packed with flavor and nutrients. Served on a whole wheat bun with fresh lettuce, tomato, avocado, and a dollop of vegan mayo, this burger is both satisfying and good for you.",
        "author": "Chef Rachel",
        "imageName": "veggie_burger",
        "category": "Burger"
    },
    {
        "id": 13,
        "name": "Tomato Basil Soup",
        "tags": "American, Soup, Vegetarian, Healthy, Dinner",
        "time": 30,
        "difficulty": "Easy",
        "ratings": 4.8,
        "isFavorite": true,
        "description": "Tomato Basil Soup is a comforting and flavorful dish made with ripe tomatoes, fresh basil, and a touch of cream. The soup is smooth and velvety, with the sweet acidity of the tomatoes balanced by the fragrant basil. Served with a side of crusty bread or a grilled cheese sandwich, this soup is perfect for a cozy meal on a chilly day.",
        "author": "Chef Luigi",
        "imageName": "tomato_basil",
        "category":"Soup"
    },
    {
        "id": 14,
        "name": "Chicken Noodle Soup",
        "tags": "American, Soup, Comfort Food, Dinner",
        "time": 45,
        "difficulty": "Medium",
        "ratings": 4.9,
        "isFavorite": true,
        "description": "Chicken Noodle Soup is the ultimate comfort food, featuring tender chicken pieces, hearty vegetables, and egg noodles simmered in a savory broth. This classic soup is perfect for soothing the soul on a cold day or when you're feeling under the weather. The rich broth and the soft noodles make it a satisfying and nourishing meal.",
        "author": "Chef Rachel",
        "imageName": "chicken_noodle",
        "category":"Soup"
    },
    {
        "id": 15,
        "name": "Minestrone Soup",
        "tags": "Italian, Soup, Vegetarian, Healthy, Dinner",
        "time": 40,
        "difficulty": "Medium",
        "ratings": 4.7,
        "isFavorite": false,
        "description": "Minestrone Soup is a hearty and nutritious Italian soup made with a variety of vegetables, beans, and pasta. The soup is simmered in a flavorful tomato broth and seasoned with Italian herbs. Each spoonful is packed with wholesome ingredients, making it a perfect choice for a light dinner or a starter to a larger meal.",
        "author": "Chef Luigi",
        "imageName": "minestrone",
        "category":"Soup"
    }
]

